[
  {
    "id": "space-app",
    "titulo": "Space App",
    "resumo": "Galeria de fotos do espaço com React e Vite.",
    "descricao": "SPA construída com Vite + React para demonstrar componentes modernos e interação com UI; ótimo para mostrar domínio de React e bundlers.",
    "descricao_detalhada": "Aplicação single-page construída com Vite e React que reúne componentes reutilizáveis, roteamento e estados locais. Serve como vitrine técnica para demonstrar domínio de bundlers, composição de componentes e boas práticas de organização de projeto. Ideal para entrevistas onde se busca conhecimento em front-end moderno e otimizações de build.",
    "tecnologias": ["Vite", "React", "JavaScript", "CSS"],
    "thumbnail": "./img/spaceappimg.jpeg",
    "imagem": "./img/spaceappimg.jpeg",
    "linkHospedagem": "https://spaceapp-nbg00jo36-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/spaceapp-sec",
    "featured": true
  },
  {
    "id": "organo",
    "titulo": "Organo",
    "resumo": "App React para cadastrar colaboradores e organizar times com UI simples.",
    "descricao": "Aplicação em React para cadastrar colaboradores e organizar times com uma interface simples; demonstra habilidades práticas em React e gerenciamento de estado.",
    "descricao_detalhada": "Projeto em React que permite cadastrar colaboradores, associá-los a times e exibir cards por equipe. Mostra habilidade com gerenciamento de estado, formulários controlados e renderização condicional. Útil para demonstrar capacidade prática em construir interfaces interativas e gerenciar dados no front-end.",
    "tecnologias": ["React", "JavaScript", "CSS"],
    "thumbnail": "./img/organoimage.png",
    "imagem": "./img/organoimage2.jpeg",
    "linkHospedagem": "https://organo-secvversion.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/organo-secversion",
    "featured": true
  },
  {
    "id": "fokus",
    "titulo": "Fokus",
    "resumo": "Aplicação simples para foco utlizando a técnica Pomodoro.",
    "descricao": "Pequeno projeto front-end focado em interações com DOM e UX; ideal para demonstrar manipulação de eventos e layout responsivo voltado para micro-interações.",
    "descricao_detalhada": "Experimento front-end que explora manipulação direta do DOM, eventos e micro-interações para melhorar a experiência do usuário. Ideal para mostrar domínio de JavaScript puro e cuidado com responsividade e acessibilidade. Ótimo para destacar técnicas de otimização de interação sem dependências externas.",
    "tecnologias": ["JavaScript", "HTML", "CSS"],
    "thumbnail": "./img/fokusimg.jpeg",
    "imagem": "./img/fokusimg.jpeg",
    "linkHospedagem": "https://fokus-project-a7cl.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/fokus-project",
    "featured": false
  },
  {
    "id": "vidflow",
    "titulo": "VidFlow",
    "resumo": "Projeto Node.js demonstrando rotas, templates e integração com front-end estático.",
    "descricao": "Projeto com Node.js que demonstra conceitos de backend (rotas, templates e processamento) e integração com front-end estático.",
    "descricao_detalhada": "Aplicação backend construída em Node.js que expõe rotas, renderiza templates e processa formulários, integrando lógica de servidor com um front-end estático. Bom para demonstrar fundamentos de API, middleware e deployment de aplicações Node. Serve como exemplo técnico para entrevistas que exigem entendimento de servidor e integração full-stack.",
    "tecnologias": ["NodeJS", "JavaScript", "CSS", "ESLint"],
    "thumbnail": "./img/vidflow.jpeg",
    "imagem": "./img/vidflow.jpeg",
    "linkHospedagem": "https://vidflow-nodejs-gzgo63g0f-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/vidflow-nodejs",
    "featured": true
  },
  {
    "id": "alurabooks",
    "titulo": "Alura Books",
    "resumo": "Catálogo de livros que demonstra consumo de dados e UI em cards.",
    "descricao": "Catálogo de livros com interface limpa; bom para demonstrar consumo de dados, layout em cards e funcionalidades básicas de UI.",
    "descricao_detalhada": "Interface que lista livros em cards, com filtros e visual limpo. Destaca consumo de dados (fetch/local), organização de layout e usabilidade. Útil para mostrar atenção ao design de componentes e experiência de leitura de conteúdo.",
    "tecnologias": ["HTML", "JavaScript", "CSS"],
    "thumbnail": "./img/alurabooks.jpeg",
    "imagem": "./img/alurabooks.jpeg",
    "linkHospedagem": "https://alurabooks-q9vgjc4ex-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/alurabooks-sec",
    "featured": false
  },
  {
    "id": "codeconnect",
    "titulo": "CodeConnect",
    "resumo": "Projeto focado em async/await e consumo de APIs para listas dinâmicas.",
    "descricao": "Projeto que explora async/await e consumo de APIs para popular listas dinâmicas — ótimo para mostrar controle de fluxo assíncrono.",
    "descricao_detalhada": "Aplicação que consome APIs externas usando async/await para popular listas e lidar com erros e estados de carregamento. Bom para demonstrar domínio em controle de fluxo assíncrono, tratamento de promise e atualização reativa da UI. Ideal em entrevistas para mostrar conhecimento prático em integrações com APIs.",
    "tecnologias": ["HTML", "JavaScript", "CSS"],
    "thumbnail": "./img/codeconnect.jpeg",
    "imagem": "./img/codeconnect.jpeg",
    "linkHospedagem": "https://codeconnect-await-async-8471ae6ts-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/codeconnect-await-async",
    "featured": false
  },
  {
    "id": "lista-de-compras",
    "titulo": "Lista de Compras",
    "resumo": "App simples com persistência local para criação e remoção de itens.",
    "descricao": "App simples de lista de compras com criação/remoção de itens e persistência local — demonstra conhecimentos práticos de DOM e storage.",
    "descricao_detalhada": "Aplicação prática que permite criar, editar e remover itens de uma lista com persistência em localStorage. Excelente para demonstrar manipulação do DOM, modelagem simples de dados e UX básico. Útil para mostrar entendimento de persistência no cliente e operações CRUD básicas no front-end.",
    "tecnologias": ["HTML", "JavaScript", "CSS"],
    "thumbnail": "./img/listadecompras.jpeg",
    "imagem": "./img/listadecompras.jpeg",
    "linkHospedagem": "https://lista-de-compras-g76ljswko-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/lista-de-compras",
    "featured": false
  },
  {
    "id": "login-screen-lol",
    "titulo": "League of Legends LoginScreen",
    "resumo": "Recriação fiel da tela de login com foco em CSS e responsividade.",
    "descricao": "Recriação da tela de login com foco em fidelidade visual e responsividade — mostra habilidade em CSS avançado e animações sutis.",
    "descricao_detalhada": "Recriação visual da tela de login do jogo, com atenção a detalhes de layout, tipografia e animações sutis. Mostra habilidade em CSS avançado (posicionamento, gradientes e animações) e preocupação com adaptação para telas móveis. Bom para demonstrar senso estético e domínio em estilos.",
    "tecnologias": ["CSS", "JavaScript", "HTML"],
    "thumbnail": "./img/loginscreen.jpeg",
    "imagem": "./img/loginscreen.jpeg",
    "linkHospedagem": "https://login-screen-m544xr02v-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/login-screen",
    "featured": false
  },
  {
    "id": "pokedex",
    "titulo": "Pokedex",
    "resumo": "Mini-app que consome API de Pokémon para exibir cards e filtros.",
    "descricao": "Mini-aplicação que consome API de Pokémon para exibir cards, filtros e detalhes — boa demonstração de consumo de APIs e UI dinâmica.",
    "descricao_detalhada": "Aplicação que consome a API pública de Pokémon para mostrar cards, filtros por tipo e uma tela de detalhes. Demonstra consumo de API, paginação/filtragem e atualização dinâmica da UI. Ótima peça para provar conhecimento em integrações externas e estruturação de componentes.",
    "tecnologias": ["CSS", "JavaScript", "HTML"],
    "thumbnail": "./img/pokedex.jpeg",
    "imagem": "./img/pokedex.jpeg",
    "linkHospedagem": "https://pokedex-isaque-2u82fgwpo-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/pokedex-isaque",
    "featured": false
  },
  {
    "id": "landing-batman",
    "titulo": "Landing Page Batman",
    "resumo": "Landing page temática com foco em layout, tipografia e efeitos visuais.",
    "descricao": "Landing page temática com foco em layout, tipografia e efeitos visuais — ideal para mostrar senso estético e atenção ao detalhe.",
    "descricao_detalhada": "Landing page conceitual que explora composição visual, tipografia e efeitos de scroll. Demonstrates senso estético e atenção ao detalhe no layout e hierarquia visual. Útil para cargos que valorizam UI/UX e design front-end.",
    "tecnologias": ["CSS", "JavaScript", "HTML"],
    "thumbnail": "./img/batmanpage.jpeg",
    "imagem": "./img/batmanpage.jpeg",
    "linkHospedagem": "https://project-batmanpage-p2t28ad8o-isaque-vergueiros-projects.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/project-batmanpage",
    "featured": false
  },
  {
    "id": "olamundo",
    "titulo": "Apresentação Olá Mundo",
    "resumo": "Este projeto é um mini site pessoal desenvolvido em React, no estilo “Olá Mundo”. Ele apresenta minha história, minha trajetória como desenvolvedor e como aluno da Alura, além de compartilhar algumas tecnologias que aprendi e que podem inspirar outras pessoas que acessarem o site. A navegação é simples e direta, permitindo conhecer melhor minha jornada no mundo da programação.",
    "descricao": "Aplicação SPA feita com React e react-router-dom para o roteamento entre páginas (Home, About, Tecnologias). Estrutura organizada em componentes funcionais, escrita em JavaScript, HTML e CSS, criada com Create React App. O projeto é leve, responsivo",
    "descricao_detalhada": "Aplicação SPA feita com React e react-router-dom para o roteamento entre páginas (Home, About, Tecnologias). Estrutura organizada em componentes funcionais, escrita em JavaScript, HTML e CSS, criada com Create React App. O projeto é leve, responsivo",
    "tecnologias": ["React", "CSS", "JavaScript", "HTML"],
    "thumbnail": "./img/olamundoreact.jpeg",
    "imagem": "./img/olamundoreact.jpeg",
    "linkHospedagem": "https://olamundoreact-nine.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/olamundoreact/tree/main/src",
    "featured": false
  },
  {
    "id": "sisvac",
    "titulo": "SisVac",
    "resumo": "Projeto Profissional desenvolvido para a Fundação Cecon com o intuito de gerenciar o controle de férias da equipe de RH.",
    "descricao": "O Projeto foi desenvolvido com Html, Css e Javascript no Front-End e JavaScript, NodeJS, Express e PostgreSQL no Back-End. O sistema conta com autenticação de usuários, controle de permissões, CRUD completo para funcionários e gerenciamento de férias. A interface é responsiva e amigável, facilitando a navegação e o uso por parte dos colaboradores do RH. ( Não posso permitir o acesso ao site por conta do banco de dados da Fundação, mas posso disponibilizar prints do sistema Funcionando)",
    "descricao_detalhada": "O Projeto foi desenvolvido com Html, Css e Javascript no Front-End e JavaScript, NodeJS, Express e PostgreSQL no Back-End. O sistema conta com autenticação de usuários, controle de permissões, CRUD completo para funcionários e gerenciamento de férias. A interface é responsiva e amigável, facilitando a navegação e o uso por parte dos colaboradores do RH. ( Não posso permitir o acesso ao site por conta do banco de dados da Fundação, mas posso dospinilizar print do sistema Funcionando ).",
    "tecnologias": [
      "React",
      "CSS",
      "JavaScript",
      "HTML",
      "NodeJS",
      "ExpressJS",
      "PostgreSQL",
      "API REST"
    ],
    "thumbnail": "./imgsisvac/sisvac.jpeg",
    "imagem": "./imgsisvac/sisvac.jpeg",
    "imagem2": "./imgsisvac/sisvac2.jpeg",
    "imagem3": "./imgsisvac/sisvac3.jpeg",
    "imagem4": "./imgsisvac/sisvac4.jpeg",
    "imagem5": "./imgsisvac/sisvac5.jpeg",
    "imagem6": "./imgsisvac/sisvac6.jpeg",
    "linkHospedagem": "https://github.com/SecVergueiro/sisvac",
    "linkRepositorio": "https://github.com/SecVergueiro/sisvac",
    "featured": false
  },
  {
    "id": "meteora",
    "titulo": "Meteroa",
    "resumo": "Projeto de e-commerce inicial focado em UX e gerenciamento de carrinho (adicionar/remover/visualizar itens). Desenvolvido com React, Context API e useReducer para o estado global; useMemo para otimizações; Vite como ferramenta de build e Bootstrap para responsividade. Aprimorei minhas habilidades em arquitetura de componentes, gerenciamento de estado e implantação de builds locais.",
    "descricao": "Desenvolvi o Meteora, um e-commerce de moda em estágio inicial, uma aplicação React criada com Vite, que implementa as funcionalidades essenciais de carrinho (adicionar, remover, visualizar e deletar itens). Usei Context API e useReducer para o gerenciamento do estado global, e useMemo para evitar re-render desnecessário em listas/processamentos. O layout foi construído com Bootstrap para garantir responsividade rápida. O projeto me permitiu praticar arquitetura de componentes, otimização de performance, integração com design (protótipo no Figma) e o fluxo completo de desenvolvimento front-end com npm/Vite e GitHub.",
    "descricao_detalhada": "Desenvolvi o Meteora, um e-commerce de moda em estágio inicial, uma aplicação React criada com Vite, que implementa as funcionalidades essenciais de carrinho (adicionar, remover, visualizar e deletar itens). Usei Context API e useReducer para o gerenciamento do estado global, e useMemo para evitar re-render desnecessário em listas/processamentos. O layout foi construído com Bootstrap para garantir responsividade rápida. O projeto me permitiu praticar arquitetura de componentes, otimização de performance, integração com design (protótipo no Figma) e o fluxo completo de desenvolvimento front-end com npm/Vite e GitHub.",
    "tecnologias": [
      "React",
      "Vite",
      "Bootstrap",
      "CSS",
      "JavaScript",
      "HTML",
      "Context API"
    ],
    "thumbnail": "./img/meteoraimg.jpeg",
    "imagem": "./img/meteoraimg.jpeg",
    "linkHospedagem": "https://meteorasec.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/meteorasec.git",
    "featured": false
  },

  {
    "id": "cinetag",
    "titulo": "CineTag",
    "resumo": "uma SPA em React que funciona como um lugar pra guardar seus vídeos e filmes, com UI modular e navegação fluida.\nUsei Hooks, Context API, React Router e CSS Modules; os dados foram prototipados via db.json",
    "descricao": "uma SPA em React que funciona como um lugar pra guardar seus vídeos e filmes, com UI modular e navegação fluida.\nUsei Hooks, Context API, React Router e CSS Modules; os dados foram prototipados via db.json",
    "descricao_detalhada": "plataforma em React criada como um “lugar pra guardar seus vídeos e filmes”, com componentes reutilizáveis e rotas.\nImplementei lógica reativa com Hooks e compartilhei estado com Context API, além de organizar estilos com CSS Modules.\nCriei uma API REST mock a partir do db.json e a hospedei no myjsonserver para servir dados durante o desenvolvimento.\nResultado: uma SPA pronta para portfólio que demonstra consumo de API, arquitetura front-end e prototipagem rápida. 🚀",
    "tecnologias": ["React", "CSS", "JavaScript", "HTML", "Context API"],
    "thumbnail": "./img/cinetagimg.jpg",
    "imagem": "./img/cinetagimg.jpg",
    "linkHospedagem": "https://cinetag-sec.vercel.app",
    "linkRepositorio": "https://github.com/SecVergueiro/cinetag-sec",
    "featured": false
  },
  {
    "id": "memoteca-angular",
    "titulo": "Memoteca (Angular)",
    "resumo": "Aplicação SPA em Angular para gerenciamento de pensamentos, notas e cards, consumindo uma API REST mock.",
    "descricao": "SPA (Single Page Application) construída com Angular que implementa operações CRUD (Criar, Ler, Atualizar, Deletar) para notas. Demonstra habilidades em TypeScript, componentes, serviços Angular e roteamento.",
    "descricao_detalhada": "Projeto de CRUD construído com Angular e TypeScript. O front-end consome uma API REST prototipada com JSON Server para o back-end, demonstrando a integração entre cliente e servidor. O ambiente de desenvolvimento local foi configurado com 'concurrently' para rodar os dois serviços simultaneamente e utiliza o Proxy do Angular CLI para contornar restrições de CORS. Excelente para demonstrar domínio em Angular, serviços HTTP, formulários reativos e estrutura de projetos full-stack.",
    "tecnologias": ["Angular", "TypeScript", "NodeJS", "JSON Server", "CSS", "HTML"],
    "thumbnail": "./img/memotecaangular.jpeg",
    "imagem": "./img/memotecaangular.jpeg",
    "imagem2": "./img/memotecaangular2.jpeg",
    "imagem3": "./img/memotecaangular3.jpeg",
    "imagem4": "./img/memotecaangularexcluir.jpeg",
    "linkHospedagem": "https://memotecasec-angular.vercel.app/listarPensamento",
    "linkRepositorio": "https://github.com/SecVergueiro/memotecasec-angular",
    "featured": true
  }
]
